Revit 2027 API
CableTraySettings.ConnectorSeparator Property
 The cable tray connector separator string.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string ConnectorSeparator { get; set; }
Public Property ConnectorSeparator As String
	Get
	Set
public:
property String^ ConnectorSeparator {
	String^ get ();
	void set (String^ value);
}
member ConnectorSeparator : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
CableTraySettings Class
Autodesk.Revit.DB.Electrical Namespace